package day05;

public class Exam1 {
    public static void main(String[] args) {
        
        

    }
}
/*
    1. 객체란? 상태 or 행위 정의(추상)하는 것
        -> 주체(개발자) vs 객체(프로그램 내 모든 대상)
        -> 상태(값/자료), 행위(함수/메소드)
    2. 객체지향 프로그래밍 : 개발자(주체)가 컴퓨터내 객체(대상) 만들기
    3. 객체 정의 : 클래스(설계도) 기반으로 객체를 정의한다
    4. 클래스란? 객체(추상개념)의 상태와 행위(함수) 코드로 정의한 곳
        1) 설계클래스(객체정의용도)     2) main함수클래스(실행목적용도)
    5. 인스턴스란? 클래스로 (객체가) 정의된 기반으로 메모리 할당
        new 연산자 이용. 
    ***** 8가지(boolean char byte short int long float double) 기본타입 ***** 
    ***** 8가지외 커스텀/정의 타입 => 새로운 타입 -> 참조 타입 *****
    즉] 클래스란? 존재하지않는 타입을 만드는것과 동일 
*/